import Image from "next/image";
import styles from "./page.module.css";
export default function Home() {
  return (
    <div className={styles.body} dir="rtl">
      <div class={styles.containerLogo}>
        <div class={styles.circle}></div>
        <Image
          className={styles.logo}
          src="/book.svg"
          alt="layout Logo"
          width={116}
          height={138}
        />
      </div>
      <div className="container-fluid d-flex flex-column w-100 ">
        <div
          className={`d-flex w-100 flex-xl-row flex-column align-items-center align-items-xl-start justify-content-md-between ${styles.parent}`}
        >
          <Image
            className={`${styles.leftSideImage} `}
            src="/sideImg.svg"
            alt="layout Logo"
            width={725}
            height={1020}
          />

          <div className={`${styles.leftSideContainer} w-50`}>
            <h1 className={styles.headTitle}>
              عرض المراجعة الخاص بتلامذة البكالوريا 2023
            </h1>
            <p>
              <span> Pack révision</span>
              هو آخر عرض لتلامذة البكالوريا للسنة الدراسية الحالية والخاص في
              جميع المواد الأساسية بإشراف ثلة من خيرة الأساتذة من ذوي الخبرة
              الكافية في إصلاح فروض البكالوريا تنطلق الحصص المباشرة في عرض Pack
              Revision
            </p>
            <div className={styles.calendar}>
              <Image src="/calendar.svg" alt="icon" width={23} height={23} />
              <span> يوم 17 ماي 2023</span>
            </div>
            <div className={styles.content}>
              <div class={styles.head}>
                <div>حصص مباشرة تفاعلية للمراجعة في المواد الأساسية</div>
                <Image
                  src="/screen.svg"
                  alt="layout Logo"
                  width={71}
                  height={55}
                />
              </div>
              <div className={`${styles.subContent}  `}>
                <div className={`${styles.sub} w-50`}>
                  <div> تمتع بعرضSilver مجانا إلى نهاية البكالوريا البيضاء</div>
                  <Image
                    src="/layout2.svg"
                    alt="layout Logo"
                    width={55}
                    height={45}
                  />
                </div>
                <div className={`${styles.sub} w-50`}>
                  <div>
                    مراجعة فعالة في المواد الأساسية لشعب البكالوريا التالية
                  </div>
                  <Image
                    src="/layout1.svg"
                    alt="layout Logo"
                    width={44.44}
                    height={56.8}
                  />
                </div>
              </div>
              <div class={`${styles.subContent} `}>
                <div class={`${styles.sub} w-50`}>
                  <div> تسجيلات حصص المراجعة</div>
                  <Image
                    src="/layout4.svg"
                    alt="layout Logo"
                    width={52.95}
                    height={47.18}
                  />
                </div>
                <div class={`${styles.sub} w-50`}>
                  <div>إصلاح اختبارات البكالوريا </div>
                  <Image
                    src="/layout3.svg"
                    alt="layout Logo"
                    width={45.25}
                    height={61.62}
                  />
                </div>
              </div>
            </div>
            <button className={styles.button}>اشترك الآن</button>
            <div className={styles.discount}>
              تمتّع بتخفيض <span>25%</span> عند الاِشتراك في جميع المواد
            </div>
          </div>
        </div>
      </div>

      <div className={`${styles.subHeadTitle} `}>
        <h1 className={`${styles.headTitle} m-0 d-inline-block`}>
          شعب البكالوريا
        </h1>
        <span className="d-block">المواد</span>
      </div>

      <div className={`${styles.corses}`}>
        <div className={`${styles.corse}`}>
          <h3>بكالوريا إقتصاد</h3>
          <ul>
            <li>
              <span>10 </span>حصص تصرّف
            </li>
            <li>
              <span>10 </span>حصص رياضيات
            </li>
            <li>
              <span>10 </span>حصص اقتصاد
            </li>
          </ul>
        </div>
        <div className={`${styles.corse}`}>
          <h3>بكالوريا إعلاميّة</h3>
          <ul>
            <li>
              <span>12 </span>حصّة فيزياء
            </li>
            <li>
              <span>10 </span>حصص رياضيات
            </li>
            <li>
              <span>08 </span>حصص رياضيات
            </li>
            <li>
              <span>08 </span>حصص STI
            </li>
          </ul>
        </div>
        <div className={`${styles.corse}`}>
          <h3>بكالوريا تقنية</h3>
          <ul>
            <li>
              <span>12 </span>حصص فيزياء
            </li>
            <li>
              <span>10 </span>حصص رياضيات
            </li>
            <li>
              <span>10 </span>حصص ميكانيك
            </li>
            <li>
              <span>10 </span>حصص إلكتريك
            </li>
          </ul>
        </div>
        <div className={`${styles.corse}`}>
          <h3>بكالوريا رياضيات</h3>
          <ul>
            <li>
              <span>12 </span>حصص فيزياء
            </li>
            <li>
              <span>10 </span>حصص رياضيات
            </li>
            <li>
              <span>06 </span>حصص علوم
            </li>
          </ul>
        </div>
        <div className={`${styles.corse}`}>
          <h3>بكالوريا علوم</h3>
          <ul>
            <li>
              <span>12 </span>حصص فيزياء
            </li>
            <li>
              <span>10 </span>حصص رياضيات
            </li>
            <li>
              <span>08 </span>حصص علوم
            </li>
          </ul>
        </div>
      </div>

      <div className={styles.discountTitle}>
        <Image
          src="/books.svg"
          alt="layout Logo"
          width={234.13}
          height={196.59}
        />
        <div>
          <p>
            تمتع بتخفيض <span>25%</span> عند الاشتراك في كل المواد مع إمكانية
            الاشتراك في أي مادة حسب الاختيار
          </p>
          <button>تمتع بمراجعة فعالة مع عرض Pack Révision</button>
        </div>
        <div className="position-relative">
          <Image
            src="/discount.svg"
            alt="layout Logo"
            width={442}
            height={325}
          />
          <Image
            className={`${styles.circleDiscount}`}
            src="/circle.svg"
            alt="layout Logo"
            width={129}
            height={129}
          />
        </div>
      </div>
      <div className={styles.fotter}>
        <Image
          src="/fotterLogo1.svg"
          alt="layout Logo"
          width={177}
          height={120}
        />
        <div className={styles.social}>
          <span>تواصل معنا</span>
          <div>
            <svg
              width="40"
              height="40"
              viewBox="0 0 40 40"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M25.2 8.86676H28.3333V3.56676C26.8163 3.409 25.2919 3.33112 23.7667 3.33342C19.2333 3.33342 16.1333 6.10009 16.1333 11.1668V15.5334H11.0167V21.4668H16.1333V36.6668H22.2667V21.4668H27.3667L28.1333 15.5334H22.2667V11.7501C22.2667 10.0001 22.7333 8.86676 25.2 8.86676Z"
                fill="#2BA7DF"
              />
            </svg>
            <svg
              width="32"
              height="32"
              viewBox="0 0 32 32"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <g clip-path="url(#clip0_1_782)">
                <path
                  d="M15.838 7.88068C14.2325 7.88068 12.663 8.35687 11.3281 9.24904C9.99313 10.1412 8.95266 11.4093 8.33825 12.8929C7.72384 14.3765 7.56308 16.009 7.8763 17.584C8.18953 19.159 8.96266 20.6057 10.0979 21.7413C11.2332 22.8768 12.6797 23.6501 14.2543 23.9633C15.829 24.2766 17.4612 24.1158 18.9445 23.5013C20.4279 22.8868 21.6957 21.8461 22.5877 20.5109C23.4796 19.1757 23.9557 17.6059 23.9557 16C23.9574 14.9333 23.7486 13.8767 23.3412 12.8909C22.9339 11.9051 22.336 11.0093 21.5818 10.2551C20.8277 9.50078 19.9322 8.90278 18.9465 8.49533C17.9609 8.08789 16.9045 7.87901 15.838 7.88068V7.88068ZM15.838 21.2773C14.7942 21.2773 13.7738 20.9677 12.9059 20.3876C12.0379 19.8076 11.3615 18.9831 10.962 18.0186C10.5625 17.054 10.458 15.9926 10.6617 14.9686C10.8653 13.9446 11.368 13.004 12.1061 12.2657C12.8442 11.5275 13.7846 11.0247 14.8084 10.821C15.8322 10.6173 16.8934 10.7219 17.8578 11.1214C18.8221 11.521 19.6464 12.1976 20.2263 13.0657C20.8063 13.9338 21.1158 14.9544 21.1158 15.9984C21.1133 17.3977 20.5564 18.7389 19.5672 19.7284C18.578 20.7178 17.237 21.2748 15.838 21.2773ZM26.1799 7.54818C26.1799 7.92397 26.0685 8.29131 25.8597 8.60377C25.651 8.91622 25.3543 9.15975 25.0072 9.30355C24.6601 9.44736 24.2782 9.48499 23.9097 9.41168C23.5412 9.33836 23.2027 9.15741 22.937 8.89169C22.6714 8.62597 22.4904 8.28742 22.4171 7.91885C22.3438 7.55029 22.3815 7.16826 22.5252 6.82108C22.669 6.4739 22.9125 6.17716 23.2249 5.96839C23.5373 5.75962 23.9046 5.64818 24.2803 5.64818C24.5301 5.64671 24.7778 5.69485 25.009 5.78982C25.2401 5.88478 25.4501 6.02468 25.6268 6.2014C25.8035 6.37813 25.9433 6.58816 26.0383 6.81935C26.1332 7.05053 26.1814 7.29826 26.1799 7.54818V7.54818ZM31.5621 9.47035C31.6143 7.00816 30.6953 4.62441 29.004 2.8346C27.2109 1.14865 24.8301 0.23044 22.3696 0.275932C19.756 0.127098 11.9217 0.127098 9.30651 0.275932C6.84551 0.226379 4.46293 1.14255 2.66892 2.82827C0.9804 4.61983 0.0618944 7.0024 0.110763 9.46402C-0.0380401 12.0781 -0.0380401 19.914 0.110763 22.5297C0.0586523 24.9919 0.977616 27.3756 2.66892 29.1654C4.4626 30.8504 6.84302 31.7684 9.30334 31.7241C11.9169 31.8729 19.7513 31.8729 22.3664 31.7241C24.8281 31.7762 27.2114 30.8571 29.0008 29.1654C30.6864 27.372 31.6045 24.9907 31.559 22.5297C31.7078 19.9156 31.7078 12.0797 31.559 9.47193L31.5621 9.47035ZM28.1856 25.3338C27.9169 26.0145 27.5113 26.6327 26.9939 27.1502C26.4765 27.6677 25.8584 28.0734 25.1778 28.3421C23.093 29.1686 18.1492 28.9754 15.838 28.9754C13.5268 28.9754 8.58307 29.1591 6.49824 28.3421C5.81766 28.0734 5.19952 27.6677 4.68214 27.1502C4.16476 26.6327 3.75917 26.0145 3.4905 25.3338C2.66417 23.2485 2.8573 18.3038 2.8573 15.9921C2.8573 13.6804 2.67367 8.73568 3.4905 6.65043C3.75917 5.96972 4.16476 5.35146 4.68214 4.83397C5.19952 4.31649 5.81766 3.91082 6.49824 3.6421C8.58307 2.8156 13.5268 3.00877 15.838 3.00877C18.1492 3.00877 23.093 2.8251 25.1778 3.6421C25.8584 3.91082 26.4765 4.31649 26.9939 4.83397C27.5113 5.35146 27.9169 5.96972 28.1856 6.65043C29.0119 8.73568 28.8188 13.6804 28.8188 15.9921C28.8188 18.3038 29.0056 23.2564 28.1856 25.3338Z"
                  fill="#2BA7DF"
                />
              </g>
              <defs>
                <clipPath id="clip0_1_782">
                  <rect
                    width="31.6667"
                    height="31.6667"
                    fill="white"
                    transform="translate(0 0.166626)"
                  />
                </clipPath>
              </defs>
            </svg>
            <svg
              width="42"
              height="42"
              viewBox="0 0 42 42"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M39.9583 16.9925C40.0428 14.4876 39.5081 12.0015 38.4038 9.76497C37.6545 8.84727 36.6147 8.22796 35.4654 8.01497C30.712 7.57314 25.939 7.39205 21.1667 7.47247C16.4118 7.3884 11.6559 7.56365 6.91917 7.99747C5.9827 8.17198 5.11606 8.62195 4.42501 9.29247C2.88751 10.745 2.71667 13.23 2.54584 15.33C2.29798 19.1057 2.29798 22.8942 2.54584 26.67C2.59526 27.8519 2.76706 29.0252 3.05834 30.17C3.26432 31.0538 3.68107 31.8716 4.27126 32.55C4.96701 33.256 5.85383 33.7316 6.81667 33.915C10.4997 34.3807 14.2107 34.5737 17.9208 34.4925C23.9 34.58 29.1446 34.4925 35.3458 34.0025C36.3323 33.8304 37.2441 33.3542 37.9596 32.6375C38.4379 32.1473 38.7951 31.5474 39.0017 30.8875C39.6126 28.9671 39.9127 26.9572 39.89 24.9375C39.9583 23.9575 39.9583 18.0425 39.9583 16.9925ZM17.3058 25.9875V15.155L27.4192 20.5975C24.5833 22.2075 20.8421 24.0275 17.3058 25.9875Z"
                fill="#2BA7DF"
              />
            </svg>
            <svg
              width="34"
              height="34"
              viewBox="0 0 34 34"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M22.4816 11.3284C24.5194 12.7897 27.0147 13.6496 29.71 13.6496V9.55224C28.2055 9.23064 26.8736 8.44163 25.8722 7.34417C24.1581 6.27074 22.9232 4.49984 22.5611 2.42712H18.7825V23.218C18.7739 25.6418 16.8139 27.6043 14.3968 27.6043C12.9725 27.6043 11.7071 26.923 10.9057 25.8675C9.47462 25.1426 8.49325 23.6545 8.49325 21.936C8.49325 19.5055 10.4565 17.5349 12.8788 17.5349C13.3429 17.5349 13.7902 17.6074 14.2098 17.741V13.5988C9.00803 13.7067 4.82454 17.9722 4.82454 23.2181C4.82454 25.8368 5.86632 28.2108 7.55715 29.9454C9.08253 30.9733 10.9188 31.5728 12.8944 31.5728C18.1893 31.5728 22.4817 27.265 22.4817 21.9511V11.3284H22.4816Z"
                fill="#2BA7DF"
              />
              <path
                d="M29.71 9.55233V8.44443C28.3534 8.4465 27.0233 8.0652 25.8723 7.34415C26.8912 8.46368 28.2329 9.23562 29.71 9.55233ZM22.5611 2.42721C22.5266 2.22912 22.5 2.02972 22.4816 1.82956V1.16003H17.2644V21.9511C17.256 24.3746 15.2961 26.3371 12.8788 26.3371C12.1691 26.3371 11.4991 26.1681 10.9057 25.8677C11.7071 26.9231 12.9725 27.6043 14.3968 27.6043C16.8137 27.6043 18.774 25.642 18.7825 23.2182V2.42721H22.5611ZM14.2101 13.5989V12.4195C13.7741 12.3597 13.3346 12.3297 12.8945 12.3299C7.5992 12.3298 3.30667 16.6375 3.30667 21.9511C3.30667 25.2824 4.99371 28.2183 7.55729 29.9453C5.86647 28.2108 4.82468 25.8367 4.82468 23.2181C4.82468 17.9722 9.00806 13.7068 14.2101 13.5989Z"
                fill="#2BA7DF"
              />
            </svg>
          </div>
        </div>
        <Image
          src="/fotterLogo2.svg"
          alt="layout Logo"
          width={355}
          height={97}
        />
      </div>
      <div className={styles.fotterSqu}></div>
    </div>
  );
}
